In [1]:
import pandas as pd

In [11]:
s=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])

In [12]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
s2=s.reindex(["b","c","e","a","d"])

In [14]:
s2

b    2
c    3
e    5
a    1
d    4
dtype: int64

In [15]:
s.drop('b')

a    1
c    3
d    4
e    5
dtype: int64

In [16]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
s.drop("c")

a    1
b    2
d    4
e    5
dtype: int64

In [19]:
import numpy as np

In [20]:
df=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],
               columns=["kar","ben","jum"])

In [21]:
df

   kar  ben  jum
a    0    1    2
b    3    4    5
c    6    7    8

In [23]:
names=["ben","jum","kar"]
df.reindex(columns=names)

   ben  jum  kar
a    1    2    0
b    4    5    3
c    7    8    6

In [24]:
df

   kar  ben  jum
a    0    1    2
b    3    4    5
c    6    7    8

In [33]:
names=["ben","jum","kar"]
df.reindex(columns=names)

   ben  jum  kar
a    1    2    0
b    4    5    3
c    7    8    6

In [37]:
import numpy as np
df=pd.DataFrame(np.arange(9).reshape(3,3),
                index=["a","c","d"],
                columns=["Tim","Tom","Kate"])
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [38]:
list('abc')

['a', 'b', 'c']

In [39]:
df=pd.DataFrame(
    np.arange(12).reshape(3,4),
    index=["two","one","three"],
    columns=["d","a","b","c"])
df

       d  a   b   c
two    0  1   2   3
one    4  5   6   7
three  8  9  10  11

In [40]:
df.sort_index()

       d  a   b   c
one    4  5   6   7
three  8  9  10  11
two    0  1   2   3

In [41]:
s=pd.Series(range(5),
            index=["e","d","a","b","c"])
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [42]:
s.sort_index()

a    2
b    3
c    4
d    1
e    0
dtype: int64

In [43]:
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [44]:
s.sort_index(inplace=True)

In [45]:
s

a    2
b    3
c    4
d    1
e    0
dtype: int64

In [46]:
s=pd.Series(range(5),
            index=["e","d","a","b","c"])
s

e    0
d    1
a    2
b    3
c    4
dtype: int64

In [48]:
df=pd.read_csv("cardekho_dataset.csv")

In [49]:
df

,Unnamed: 0,car_name,brand,model,vehicle_age,km_driven,seller_type,fuel_type,transmission_type,mileage,engine,max_power,seats,selling_price
0,0,Maruti Alto,Maruti,Alto,9,120000,Individual,Petrol,Manual,19.70,796,46.30,5,120000
1,1,Hyundai Grand,Hyundai,Grand,5,20000,Individual,Petrol,Manual,18.90,1197,82.00,5,550000
2,2,Hyundai i20,Hyundai,i20,11,60000,Individual,Petrol,Manual,17.00,1197,80.00,5,215000
3,3,Maruti Alto,Maruti,Alto,9,37000,Individual,Petrol,Manual,20.92,998,67.10,5,226000
4,4,Ford Ecosport,Ford,Ecosport,6,30000,Dealer,Diesel,Manual,22.77,1498,98.59,5,570000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15406,19537,Hyundai i10,Hyundai,i10,9,10723,Dealer,Petrol,Manual,19.81,1086,68.05,5,250000
15407,19540,Maruti Ertiga,Maruti,Ertiga,2,18000,Dealer,Petrol,Manual,17.50,1373,91.10,7,925000
15408,19541,Skoda Rapid,Skoda,Rapid,6,67000,Dealer,Diesel,Manual,21.14,1498,103.52,5,425000
15409,19542,Mahindra XUV500,Mahindra,XUV500,5,3800000,Dealer,Diesel,Manual,16.00,2179,140.00,7,1225000
15410,19543,Honda City,Honda,City,2,13000,Dealer,Petrol,Automatic,18.00,1497,117.60,5,1200000

In [55]:
df.fuel_type.value_counts()

fuel_type
Petrol      7643
Diesel      7419
CNG          301
LPG           44
Electric       4
Name: count, dtype: int64

In [54]:
df.describe()

,Unnamed: 0,vehicle_age,km_driven,mileage,engine,max_power,seats,selling_price
count,15411.000000,15411.000000,1.541100e+04,15411.000000,15411.000000,15411.000000,15411.000000,1.541100e+04
mean,9811.857699,6.036338,5.561648e+04,19.701151,1486.057751,100.588254,5.325482,7.749711e+05
std,5643.418542,3.013291,5.161855e+04,4.171265,521.106696,42.972979,0.807628,8.941284e+05
min,0.000000,0.000000,1.000000e+02,4.000000,793.000000,38.400000,0.000000,4.000000e+04
25%,4906.500000,4.000000,3.000000e+04,17.000000,1197.000000,74.000000,5.000000,3.850000e+05
50%,9872.000000,6.000000,5.000000e+04,19.670000,1248.000000,88.500000,5.000000,5.560000e+05
75%,14668.500000,8.000000,7.000000e+04,22.700000,1582.000000,117.300000,5.000000,8.250000e+05
max,19543.000000,29.000000,3.800000e+06,33.540000,6592.000000,626.000000,9.000000,3.950000e+07

In [56]:
df.transmission_type.value_counts()

transmission_type
Manual       12225
Automatic     3186
Name: count, dtype: int64

In [63]:
df.car_name.count()

15411

In [64]:
df.car_name.value_counts()

car_name
Hyundai i20           906
Maruti Swift Dzire    890
Maruti Swift          781
Maruti Alto           778
Honda City            757
                     ...
Mercedes-AMG C          1
Tata Altroz             1
Ferrari GTC4Lusso       1
Hyundai Aura            1
Force Gurkha            1
Name: count, Length: 121, dtype: int64

In [67]:
df.mileage.max()

33.54

In [68]:
df.mileage.min()

4.0